[
  {
    "id": "BioExcel2_UC3_WF1",
    "name": "Automatically predicting drug sensitivity and resistance patterns for clinically relevant EGFR mutations",
    "abstract": "Mutations in the kinase domain of the Epidermal Growth Factor Receptor (EGFR) can be drivers of cancer and cause drug resistance in patients under treatment. While it is a well-known issue for first-generation ATP-competitive inhibitors, second-generation inhibitors display limited efficacy in circumventing the gatekeeper mutation, and third-generation inhibitors are mutant-selective, but drug resistance could still eventually occur. There is thus a pressing need for anticipating the consequences of such mutations in drug development and clinical practice. We have devised a workflow for classifying EGFR mutations by their impact on binding FDA-approved drugs for predicting drug sensitivity/resistance patterns for clinically relevant EGFR mutations. The workflow combines the BioExcel Building Blocks (BioBB) library with pmx/GROMACS for free energy calculations and PyCOMPSs for efficient parallelization on HPC infrastructures. We can correctly classify 23 out of 35 clinically relevant EGFR mutations by their impact on the binding affinity of FDA-approved drugs and improve the accuracy from 0.694 to up to 0.800 when removing charge-changing or His-involving mutations, which are problematic in any free-energy based method.",
    "path": "uc3/BioExcel2_UC3_WF1.pdf"
  },
  {
    "id": "BioExcel2_UC3_WF2",
    "name": "Evolutionary Path and Host-selection Mechanism of SARS-CoV-2",
    "abstract": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has been spreading worldwide with dramatic consequences. Its elusive and still much debated proximal origin strongly limits the possibility of foreseeing other spillover events with high-risk pandemic potential. Several related coronaviruses have been identified so far and RaTG13 is currently believed the closest bat ancestor. However, the wealth of current available evidences is still scarce and does not inform on the evolutionary path SARS-CoV-2 has trailed from bats to humans. Here, through massive plain MD simulations, enhanced sampling calculations, free energy-based alchemical transformation and bioinformatics we show that SARS-CoV-2 likely evolved in Rhinolophus affinis bats by acquiring a surprisingly-high affinity for their ACE2 receptors. Our results elucidate the receptor binding mode and host adaption mechanisms of RaTG13 and clarify the nature of the multiple selective pressures spike protein underwent that have caused those key mutations accumulated from RaTG13 to SARS-CoV-2. Overall, our study emphasizes the need of a continuous surveillance of coronaviruses vehiculated by animal reservoirs to prevent future pandemics.",
    "path": "uc3/BioExcel2_UC3_WF2.pdf"
  },
  {
    "id": "BioExcel2_UC3_WF4",
    "name": "DNAffinity: A MACHINE-LEARNING APPROACH TO PREDICT DNA BINDING AFFINITIES OF TRANSCRIPTION FACTORS",
    "abstract": "We present a physics-based machine learning approach to predict transcription factor binding affinities in vitro from structural and mechanical DNA properties directly derived from atomistic molecular dynamics simulations. The method is able to predict affinities obtained with techniques as different as uPBM, gcPBM and HT-SELEX with a predictive power superior to existing algorithms and a full generality which can be used to in the future to accommodate non-coding nucleobases. When complemented with chromatin structure information, our in vitro trained method provides estimates of in vivo binding sites in yeast with unprecedented accuracy.",
    "path": "uc3/BioExcel2_UC3_WF4.pdf"
  },
  {
    "id": "BioExcel2_CV19_Review",
    "name": "Pre-Exascale HPC- approaches for Molecular Dynamics simulations. Covid-19 research: a use case",
    "abstract": "Exascale computing has been a dream for ages and is close to become a reality that will impact the way in which molecular simulations are being performed and the quantity and quality of the information derived for them. We review how the biomolecular simulations field is anticipating these new architectures, making emphasis in recent work from groups in the BioExcel Center of Excellence for High Performance Computing. We exemplified the power of these simulation strategies with the work done by the HPC simulation community to fight Covid-19 pandemics.",
    "path": "uc3/BioExcel2_CV19_Review.pdf"
  },
  {
    "id": "BioExcel2_UC3_HPC_Workflows",
    "name": "Enabling the execution of large scale workflows for molecular dynamics simulations",
    "abstract": "The usage of workflows has led to progress in many fields of science, where the need to process large amounts of data is coupled with difficulty in accessing and efficiently using High Performance Computing platforms. On the one hand, scientists are focused on their problem and concerned with how to process their data. On top of that, the applications typically have different parts written using different programming models and languages as MPI or OpenMP, thus complicating the distribution, the portability and the reproducibility of the simulations. On the other hand, computer scientists concentrate on how to develop frameworks for the deployment of workflows on HPC or HTC resources, often providing separate solutions for the computational aspects and the data analytic ones. In this paper we present an approach to support biomolecular researchers in the development of complex workflows that i) allow them to compose pipelines of individual simulations built from different tools and interconnected by data dependencies, ii) run them seamlessly on different computational platforms, and iii) scale them up to the large number of cores provided by modern supercomputing infrastructures. Our approach is based on the orchestration of computational building blocks for Molecular Dynamics simulations through an efficient workflow management system that has already been adopted in many scientific fields to run applications on multitudes of computing backends. Results demonstrate the validity of the proposed solution  through the execution of massively parallel runs in a supercom- puter facility.",
    "path": "uc3/BioExcel2_UC3_HPC_Workflows.pdf"
  }
]






